"Automatically Install" = "خۆكارانە دا دەمەزرێنێت";

"Delete After Install" = "سڕینەوە دوای دامەزراندن";

"Remove Metadata" = "لابردنی Metadata";

"Keep Awake" = "بەئاگا بهێڵەوە";

"This will keep your screen always ON while using AppCake" = "ئەمە شاشەت هەميشە لەسەری دەهێڵێتەوە لەکاتی بەکارهێنانی AppCake";

"Remove Metadata will stop App Store from updating the app" = "زانيارى دەربارەى كۆگاى بەرنامەکان لە نوێكردنەوەى بەرنامەوە ڕا دەگرێت";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes." = "توانابدە بە iTunes Sync تا بەرنامە لەلايەن AppCake دا بمەزرێن تا بۆ كۆمپيوتەرت بگوازرێەوە.";

"iTunes Sync" = "iTunes Sync";

"Feedback" = "تێبينى";

"Changelog" = "گۆڕانکاریەکان";

"I Can Translate" = "من دەتوانم وەر بگێڕم";

"Clear Image Cache" = "پاکردنەوەی حەشارگەی وێنە";

"Settings" = "ڕێکخستنەکان";

